In [1]:
import pandas as pd

In [2]:
data = {
    'Nombre_Completo': ['Juan Perez', 'Maria Gomez', 'Luis Martinez']
}

df = pd.DataFrame(data)
display(df)

  Nombre_Completo
0      Juan Perez
1     Maria Gomez
2   Luis Martinez

In [3]:
df[['Nombre', 'Apellido']] = df['Nombre_Completo'].str.split(' ', expand=True)
display(df)

  Nombre_Completo Nombre  Apellido
0      Juan Perez   Juan     Perez
1     Maria Gomez  Maria     Gomez
2   Luis Martinez   Luis  Martinez

In [4]:
data_fechas = {
    'Fecha': ['01-01-2024', '15-02-2024', '30-03-2024']
}

df_fechas = pd.DataFrame(data_fechas)
display(df_fechas)

        Fecha
0  01-01-2024
1  15-02-2024
2  30-03-2024

In [5]:
df_fechas[['Día', 'Mes', 'Año']] = df_fechas['Fecha'].str.split('-', expand=True)
display(df_fechas)

        Fecha Día Mes   Año
0  01-01-2024  01  01  2024
1  15-02-2024  15  02  2024
2  30-03-2024  30  03  2024

In [7]:
df['Nombre_Completo_nuevo'] = df['Nombre'] + ';' + df['Apellido']
display(df)

  Nombre_Completo Nombre  Apellido Nombre_Completo_nuevo
0      Juan Perez   Juan     Perez            Juan;Perez
1     Maria Gomez  Maria     Gomez           Maria;Gomez
2   Luis Martinez   Luis  Martinez         Luis;Martinez

In [9]:
df_fechas['Fecha_Completa'] = df_fechas[['Día', 'Mes', 'Año']].agg('/'.join, axis=1)
display(df_fechas)

        Fecha Día Mes   Año Fecha_Completa
0  01-01-2024  01  01  2024     01/01/2024
1  15-02-2024  15  02  2024     15/02/2024
2  30-03-2024  30  03  2024     30/03/2024

In [10]:
df_direcciones = pd.DataFrame({'Dirección': ['Calle 123, Lima', 'Avenida 45, Bogotá']})
display(df_direcciones)

            Dirección
0     Calle 123, Lima
1  Avenida 45, Bogotá

In [11]:
df_direcciones[['Calle', 'Número', 'Ciudad']] = df_direcciones['Dirección'].str.extract(r'(\D+)\s(\d+),\s(\D+)')
display(df_direcciones)

            Dirección    Calle Número  Ciudad
0     Calle 123, Lima    Calle    123    Lima
1  Avenida 45, Bogotá  Avenida     45  Bogotá